// app/config/config.js

export const validSources = ["CAINIAO-E", "MMA-CN", "TEMU", "CNE"];

export const mapping = {
  大阪: ["大阪府", "滋賀県", "Ōsaka", "osaka", "oosaka", "兵庫県"],
  東京: ["東京都", "神奈川県", "千葉県", "埼玉県", "群馬県"],
  滋賀: ["滋賀県"],
  兵庫1: [
    "兵庫県姫路市",
    "兵庫県小野市",
    "兵庫県加古川市",
    "兵庫県高砂市",
    "兵庫県三木市",
    "兵庫県加古郡　播磨町",
    "兵庫県加古郡　稲美町",
    "兵庫県明石市",
    "兵庫県神戸市　西区",
    "兵庫県神戸市　垂水区",
    "兵庫県神戸市　須磨区",
    "兵庫県宝塚市",
    "兵庫県川西市",
  ],
};

export const taskList = [
  { time: "8:00", job: "横持ちカゴ確認" },
  { time: "8:30", job: "KPI確認" },
  { time: "9:30", job: "返品確認　午前" },
  { time: "10:00", job: "FCST 午前" },
  { time: "10:00", job: "再配達確認　前日分" },
  { time: "10:30", job: "不正ステータス確認" },
  { time: "11:00", job: "サイトユーザー登録住所確認" },
  { time: "12:00", job: "再配達確認　8～12時" },
  { time: "13:00", job: "CNC　業者引き渡し" },
  { time: "14:00", job: "配達失敗件数記録" },
  { time: "14:30", job: "日報貨物件数記録" },
  { time: "15:00", job: "返品確認　午後" },
  { time: "15:00", job: "桃太郎件数報告" },
  { time: "16:00", job: "再配達確認　12～16時" },
  { time: "16:30", job: "桃太郎誤仕分確認" },
  { time: "17:00", job: "SPG件数報告（社員）" },
  { time: "17:00", job: "翌日分再出荷確認" },
  { time: "17:00", job: "SPG集荷漏れ確認" },
  { time: "17:30", job: "保税エリアの許可貨物確認" },
  { time: "17:30", job: "ヤマト貼替データCS送信" },
  { time: "17:30", job: "FCST 午後" },
  { time: "17:55", job: "再出荷最終確認" },
  { time: "18:00", job: "現場残貨確認（社員）" },
  { time: "18:00", job: "コールセンター集計（平日テレ）" },
  { time: "19:00", job: "愛陸車両確認（社員）" },
];

export const personList = [
  "郭",
  "築藤",
  "三浦",
  "村田",
  "ススミタ",
  "ビカス",
  "村崎",
  "華",
  "杜",
  "末安",
  "中野"];

export const messages = {
  "/": [
    "やっほ〜！ホームページへようこそっ♪",
    "今日もステキな一日になりますように",
    "ฅ^•ω•^ฅ にゃーん♡",
  ],
  "/taskCheckSheet": [
    "今日のタスク、いっしょに確認しよ〜！",
    "まずは「担当者」にお名前を入れてねっ！",
    "全部入力できたら「保存」をポチッと",
    "今日もお仕事がんばってえらいっ！",
  ],
  "/fcstmaker": [
    "FCSTをつくってみよ〜！٩(๑❛ᴗ❛๑)۶",
    "まずは「マスタ抽出」にFCSTをインポートしてね！",
    "つぎに「2.0航空貨物」でデータをゲット！",
    "ゲットできたら「集計」にインポートしてみよ！",
    "最後に対象のFCSTをえらんで「FCST作成」をクリック！",
    "できた！おつかれさま〜 (*ˊᗜˋ*)ﾉ",
  ],
  "/momotrolley": [
    "桃カゴ車チェックページへようこそっ",
    "まずは表でカゴの状態を見てみよう〜！",
    "朝と夜の2回、「戻」と「出」を入力するよ",
    "夜のデータは、朝のデータをいれてからね！",
    "「更新者」の選択も忘れずにっ！",
    "同じ状態は重複できないから気をつけてね",
    "入力できたら「保存」をポチッと",
    "下の履歴では過去7日分のデータも見れるよ",
    "今日もがんばったね♡おつかれさま〜",
  ],
};

export const trolleyList = ["114", "80", "12", "174", "94", "162", "130", "228", "102", "142",];