// app/config/config.js

// FCST對象代理店
export const validSources = ["CAINIAO-E", "MMA-CN", "TEMU", "CNE"];

// 任務表
export const taskList = [
  { time: "8:00", job: "横持ちカゴ確認" },
  { time: "8:30", job: "KPI確認" },
  { time: "9:30", job: "返品確認　午前" },
  { time: "10:00", job: "FCST 午前" },
  { time: "10:00", job: "再配達確認　前日分" },
  { time: "10:30", job: "不正ステータス確認" },
  { time: "11:00", job: "サイトユーザー登録住所確認" },
  { time: "12:00", job: "再配達確認　8～12時" },
  { time: "13:00", job: "CNC　業者引き渡し" },
  { time: "14:00", job: "配達失敗件数記録" },
  { time: "14:30", job: "日報貨物件数記録" },
  { time: "15:00", job: "返品確認　午後" },
  { time: "15:00", job: "桃太郎件数報告" },
  { time: "16:00", job: "再配達確認　12～16時" },
  { time: "16:30", job: "桃太郎誤仕分確認" },
  { time: "17:00", job: "SPG件数報告（社員）" },
  { time: "17:00", job: "翌日分再出荷確認" },
  { time: "17:00", job: "SPG集荷漏れ確認" },
  { time: "17:30", job: "保税エリアの許可貨物確認" },
  { time: "17:30", job: "ヤマト貼替データCS送信" },
  { time: "17:30", job: "FCST 午後" },
  { time: "17:55", job: "再出荷最終確認" },
  { time: "18:00", job: "現場残貨確認（社員）" },
  { time: "18:00", job: "コールセンター集計（平日テレ）" },
  { time: "19:00", job: "愛陸車両確認（社員）" },
];

export const personList = [
  "郭",
  "築藤",
  "三浦",
  "村田",
  "ススミタ",
  "ビカス",
  "村崎",
  "池田",
  "華",
  "杜",
  "末安",
  "中野"];

// AD臺詞
export const messages = {
  "/": [
    "やっほ〜！ホームページへようこそっ♪",
    "今日もステキな一日になりますように",
    "ฅ^•ω•^ฅ にゃーん♡",
  ],
  "/taskCheckSheet": [
    "今日のタスク、いっしょに確認しよ〜！",
    "まずは「担当者」にお名前を入れてねっ！",
    "全部入力できたら「保存」をポチッと",
    "今日もお仕事がんばってえらいっ！",
  ],
  "/fcstmaker": [
    "FCSTをつくってみよ〜！٩(๑❛ᴗ❛๑)۶",
    "まずは「マスタ抽出」にFCSTをインポートしてね！",
    "つぎに「2.0航空貨物」でデータをゲット！",
    "ゲットできたら「集計」にインポートしてみよ！",
    "最後に対象のFCSTをえらんで「FCST作成」をクリック！",
    "できた！おつかれさま〜 (*ˊᗜˋ*)ﾉ",
  ],
  "/momotrolley": [
    "桃カゴ車チェックページへようこそっ",
    "まずは表でカゴの状態を見てみよう〜！",
    "朝と夜の2回、「戻」と「出」を入力するよ",
    "夜のデータは、朝のデータをいれてからね！",
    "「更新者」の選択も忘れずにっ！",
    "同じ状態は重複できないから気をつけてね",
    "入力できたら「保存」をポチッと",
    "下の履歴では過去7日分のデータも見れるよ",
    "今日もがんばったね♡おつかれさま〜",
  ],
};

// 桃桃車編號
export const trolleyList = ["114", "80", "12", "174", "94", "162", "130", "228", "102", "142",];

export const prefectures = [
  { code: "01", name: "北海道" },
  { code: "02", name: "青森県" },
  { code: "03", name: "岩手県" },
  { code: "04", name: "宮城県" },
  { code: "05", name: "秋田県" },
  { code: "06", name: "山形県" },
  { code: "07", name: "福島県" },
  { code: "08", name: "茨城県" },
  { code: "09", name: "栃木県" },
  { code: "10", name: "群馬県" },
  { code: "11", name: "埼玉県" },
  { code: "12", name: "千葉県" },
  { code: "13", name: "東京都" },
  { code: "14", name: "神奈川県" },
  { code: "15", name: "新潟県" },
  { code: "16", name: "富山県" },
  { code: "17", name: "石川県" },
  { code: "18", name: "福井県" },
  { code: "19", name: "山梨県" },
  { code: "20", name: "長野県" },
  { code: "21", name: "岐阜県" },
  { code: "22", name: "静岡県" },
  { code: "23", name: "愛知県" },
  { code: "24", name: "三重県" },
  { code: "25", name: "滋賀県" },
  { code: "26", name: "京都府" },
  { code: "27", name: "大阪府" },
  { code: "28", name: "兵庫県" },
  { code: "29", name: "奈良県" },
  { code: "30", name: "和歌山県" },
  { code: "31", name: "鳥取県" },
  { code: "32", name: "島根県" },
  { code: "33", name: "岡山県" },
  { code: "34", name: "広島県" },
  { code: "35", name: "山口県" },
  { code: "36", name: "徳島県" },
  { code: "37", name: "香川県" },
  { code: "38", name: "愛媛県" },
  { code: "39", name: "高知県" },
  { code: "40", name: "福岡県" },
  { code: "41", name: "佐賀県" },
  { code: "42", name: "長崎県" },
  { code: "43", name: "熊本県" },
  { code: "44", name: "大分県" },
  { code: "45", name: "宮崎県" },
  { code: "46", name: "鹿児島県" },
  { code: "47", name: "沖縄県" }
];

// 不顯示ad助手的畫面
export const hidePaths = ["/population", "/yamatocsv"];